{
  "arxiv_id": "2309.04037v3",
  "title": "SRN-SZ: Deep Leaning-Based Scientific Error-bounded Lossy Compression\n  with Super-resolution Neural Networks",
  "abstract": "The fast growth of computational power and scales of modern super-computing\nsystems have raised great challenges for the management of exascale scientific\ndata. To maintain the usability of scientific data, error-bound lossy\ncompression is proposed and developed as an essential technique for the size\nreduction of scientific data with constrained data distortion. Among the\ndiverse datasets generated by various scientific simulations, certain datasets\ncannot be effectively compressed by existing error-bounded lossy compressors\nwith traditional techniques. The recent success of Artificial Intelligence has\ninspired several researchers to integrate neural networks into error-bounded\nlossy compressors. However, those works still suffer from limited compression\nratios and/or extremely low efficiencies. To address those issues and improve\nthe compression on the hard-to-compress datasets, in this paper, we propose\nSRN-SZ, which is a deep learning-based scientific error-bounded lossy\ncompressor leveraging the hierarchical data grid expansion paradigm implemented\nby super-resolution neural networks. SRN-SZ applies the most advanced\nsuper-resolution network HAT for its compression, which is free of time-costing\nper-data training. In experiments compared with various state-of-the-art\ncompressors, SRN-SZ achieves up to 75% compression ratio improvements under the\nsame error bound and up to 80% compression ratio improvements under the same\nPSNR than the second-best compressor.",
  "authors": [
    "Jinyang Liu",
    "Sheng Di",
    "Sian Jin",
    "Kai Zhao",
    "Xin Liang",
    "Zizhong Chen",
    "Franck Cappello"
  ],
  "published": "2023-09-07T22:15:32Z",
  "categories": [
    "cs.LG",
    "cs.DC",
    "cs.IT",
    "math.IT"
  ],
  "pdf_url": "http://arxiv.org/pdf/2309.04037v3",
  "url": "http://arxiv.org/abs/2309.04037v3",
  "download_date": "2025-08-17T19:44:03.498712",
  "pdf_path": "./plagarism/scraped_data/arxiv/pdfs/2309.04037v3.pdf",
  "file_size": 2978240,
  "relevance_score": 10
}