{
  "metadata": {
    "url": "https://arxiv.org/html/2506.22659v1",
    "title": "Corresponding Author: koltick@purdue.edu] # Dark Matter Induced Neutron Production Search Limits ###...",
    "domain": "arxiv.org",
    "extraction_date": "2025-08-16T05:09:11.563619",
    "content_quality": "high",
    "quality_score": 1.0,
    "content_type": "academic"
  },
  "content": {
    "title": "Corresponding Author: koltick@purdue.edu] # Dark Matter Induced Neutron Production Search Limits ###...",
    "summary": "Corresponding Author: koltick@purdue.edu] # Dark Matter Induced Neutron Production Search Limits ###### Abstract An independent indirect detection search for Dark Matter-Matter (DM-M) interactions is undertaken to set cross section limits based on neutron production data collected by the NMDS-II detector for 1440 hours at 1166 m.w.e. and 6504 hours at 583 m.w.e.. The detector system consists of a 30 cm cube Pb-target instrumented with 60 3He neutron counters. The neutron detector system calibrat...",
    "full_text": "Corresponding Author: koltick@purdue.edu] # Dark Matter Induced Neutron Production Search Limits ###### Abstract An independent indirect detection search for Dark Matter-Matter (DM-M) interactions is undertaken to set cross section limits based on neutron production data collected by the NMDS-II detector for 1440 hours at 1166 m.w.e. and 6504 hours at 583 m.w.e.. The detector system consists of a 30 cm cube Pb-target instrumented with 60 3He neutron counters. The neutron detector system calibrated with a 252Cf source yields a single particle detection efficiency of 23.2%1.2%. During data collection, the highest neutron multiplicity event observed 54 neutrons. The neutron multiplicity, n, distribution, fits well to a power law , for both the data and cosmic ray muon induced neutron production in Geant4 simulations. Two DM-M interaction models were used to set limits. The first, a spallation model, assumes a single proton with kinetic energy equal to the DM-M interaction energy. The other, a fire-ball model assumes an annihilation between DM-M producing pions with a limiting Hagedorn temperature. The two extreme models produce similar upper DM-M cross section limits over the DM mass range between 300 MeV to 100 GeV. Limits assume all the DM energy is deposited in the Pb-target. Spin independent limits, proportional to A-2, are at the level 10. Spin dependent limits, proportional to A-1, are at the level, . † †preprint: APS/123-QED ## I Introduction The nature of dark matter has been one of the most intriguing problems in fundamental physics and cosmology. Based on the standard model of cosmology, the total mass-energy of the known universe contains 4.9% ordinary matter, 26.8% dark matter and 68.3% dark energy [1]. Although there is extensive evidence of dark matter in astrophysical observations, dark matter particles have not been detected. Dark matter searches can use direct or indirect detection methods. Present WIMP Dark Matter (DM) search strategies are focused on possible direct detection through elastic or inelastic scatterings on atomic nuclei, or with electrons. This approach become insensitive to M10 GeV. The XENON series [2], LUX [3] and SuperCDMS [4] are some notable dark matter direct detection experiments. For mass GeV direct detection methods [5, 6, 7] yield DM-nucleon cross section limits of order . Indirect DM detection refers to the search for the annihilation or decay debris from DM particles, resulting in detectable species, including especially gamma rays, neutrinos, and antimatter particles. Astrophysical observations play a dominant role in current Dark Matter indirect detection searches. Examples are gamma observations from the Cherenkov Telescope Array[8], neutrino observation from IceCube [9], and results from the ANTARES Telescope [10]. However, for low-mass dark matter particles, , the sensitivities for DM-M or DM-DM couplings are poor in both current direct detection searches and indirect detection searches. This situation can be improved by the search for DM-M interactions observable through excess high multiplicity neutron production in nuclear targets. Even for M 10 GeV DM-M annihilation is capable of producing large signals, 200 neutrons if the energy is deposited in a Pb-target. For high energy particles, a solid detector consisting of high mass number nuclei, acts similar to a solid state detector to -rays, except the band gap is of order 10 MeV. In addition, DM-M spin independent cross sections are proportional to and A for spin dependent interactions, favoring a simple Pb-target. For these reasons we reanalyzed the Neutron Multiplicity Detector System-II (NMDS-II) data sets (2001- 2003) for an indirect dark matter search using a Pb-target. A unique feature of the data sets is the identical detector being located underground at both 583 m.w.e. and 1166 m.w.e.. Such a placement allows a reduction in the systematic errors by comparing the results to one another. In addition, the higher level of cosmic ray induced background at the 583 m.w.e. depth is used to verify the background expectations at 1166 m.w.e. depth. It is the data set at 1166 m.w.e. depth that is used to set the DM interaction cross section limits. Limits are set based on the background neutron number spectrum comparing the two NMDS-II data sets with Geant4 simulations of cosmic ray muon induced neutron production, both directly by muons passing through the detector as well as by interactions in the detector from associated muon induced shower particles produced in the surrounding rock. ## II The NMDS-II Experiment ### II.1 Neutron Detection System The NMDS-II detector is an instrumented 30 cm cube of Pb (305 kg), which serves as the target. The Pb-cube is surrounded by 15 cm thick polyethylene moderators, within which 60 3He proportional neutron counters, model SNM-18, produced by Maxiums Energy, are encased on all 6-sides, as shown in the Figure 1. The 3He proportional tubes serve as the neutron multiplicity detection system. Each counter measures 28.5 cm long and 1.55 cm in diameter filled with a mixture of 3He (75%) and Ar(25%) at 4 atm pressure and operated in proportional mode at 1400 V. The neutron counters are arranged in top and bottom cap panels and 4 side panels forming the polyethylene box as shown in the Figure 2. The positions of the 3He counters were chosen by Monte-Carlo modeling, optimized so that neutron events occurring at any point in the target would be registered with almost the same efficiency. A single neutron hit triggers the 3He counter system to record data for 256 . Each hit causes the tube to be non-responsive or dead for a period of 10 . The neutron half-life in the lead target is 65 , resulting in an average of 6.47% of the total neutrons produced to be outside the data collection window. The two neutron multiplicity data sets collected by the NMDS-II, at 583 m.w.e. and at 1166 m.w.e. are shown in Figure 3. ### II.2 Environmental Background Rejection Apart from cosmic-induced neutrons, the main background in the NMDS-II experiment is radioactivity inside the lead target and from the surrounding rock. Neutrons arise from two sources: i) spontaneous fission of 238U and ii) () reactions initiated by -particles from U or Th decay [11]. Independent Geant4 simulations for the two processes were performed to estimate the upper limit of the number of neutrons detected due to natural neutron radioactivity. The process with threshold at and the process with threshold at in the lead target were included. For the spontaneous fission, the neutron energy spectrum is obtained from [12] and the number distribution of fission neutron is obtained from [13]. For () reactions, the neutron energy is set to be uniformly distributed from 0 to 12 MeV, taken from the upper limit of the neutron energy generated from the Be()C reaction. Doing so overestimates the mean neutron energy, and likewise the rate is overestimated. At 1166 m.w.e., 157 events with 3 detected neutrons are observed during 1440 hours. These includes electronic noise events, natural decays, and cosmic-ray-produced neutrons. This observations can be used to set an upper limit on the contribution of natural decay induced events populating the analysis sample. Assuming all events with detected neutron multiplicity equal to 3 originate from fission inside the lead target, the simulation yields 9 events at the detected multiplicity 4 and 0.2 events at detected multiplicity 5. Assuming all events with detected multiplicity 3 originate from () inside the lead target, the simulation yields less than 0.01 events at the detected multiplicity at 4 and less than 0.001 events at the detected multiplicity at 5. The same study was conducted for the production of fission and (, n) from surrounding rock, also matching 157 events with 3 detected neutrons. The fission yielded less than 0.05 events with 5 detected neutrons or more and (, n) yielded less than 0.001 events with 5 detected neutrons or more. In addition, there are system-wide single-rate backgrounds, including electronic noise. At 1166 m.w.e., the observation rate of at least 1 neutron is , which includes electronic noise, natural decays and cosmic ray produced neutrons. This rate can be used to set an upper limit on the single-rates producing false higher neutron multiplicity events. If it is assumed that the number of events in one time selection window, , follows a Poisson distribution, the probability of observed neutron multiplicity at 4 or more is less than . With these considerations, to ensure a pure sample of events whose background are only cosmic ray-induced neutrons, a minimum of 5 observed neutrons are required. ## III Neutron Detector System Modeling The system-wide single neutron detection efficiency was calibrated using a 252Cf source placed at the center of the target and found to be 23.2%. However, the systems response to 252Cf is not the response to muon induced neutron production because of the difference in their energy spectra. To accurately estimate the detection efficiency of a produced neutron, whether produced in the lead target or surrounding rock, a Geant4 model detector was built matching the geometry of the lead target, the polyethylene thermalizer and the arrangement of 3He counters. The 3He tubes detect neutrons through the reaction | (1) | In the Geant4 simulation, when reaction (1) is observed, the corresponding counter is considered to generate a signal or neutron hit, without modeling the complex ion particle motion within the gas and walls of the tubes. If the diameter of the 3He tube in the simulation is chosen to be 1.55 cm as manufactured, the average neutron efficiency for the 252Cf spectrum is calculated to be , which is larger than the measured result. The difference between the simulation predicted efficiency and the measured efficiency is due to the wall effect[14]. The wall effect reduces the detection efficiency because either the proton or the triton or both strike the detector’s cathode or the non-sensitive volume at the counters’ end, producing a reduced energy pulse, less than the Q in Equation (1). If the energy deposition is below the set threshold, no hits are recorded. The wall effect, that is, the reaction products 3He(n,p)3H occurring within one mean free path length away from the wall, and the set threshold are then important parameters in calculating the system’s neutron detection efficiency. The mean free path length can be calculated analytically. Because the 3He tubes thresholds were set close to Q, the neutron detection efficiency is reduced by a geometric multiplying factor, 82%, entirely due to the wall effect[15]. Correcting the 252Cf Monte Carlo calculated calibration efficiency yields MC(252Cf) Wall Effect = 0.28 , in agreement with the measured 252Cf result. Based on these results, the method used to calculate the neutron detection efficiency was to assume a reduced active 3He diameter set to 1.33 cm and record as a hit any observation of reaction (1). In order to keep the amount of polyethylene the same, the diameter of the tube is kept at 1.55 cm, but the tube has an empty gap to account for the wall effect and threshold setting. ## IV Muon Propagation to Depth At experimental depth the only remaining cosmic ray particles left are muons and neutrinos. The rate of neutrino induced events is at least 6 orders of magnitude less than muon rates. The neutron production in the lead target is the result of direct interactions of the cosmic-ray muons with the target and secondary particle production by muons with the surrounding rock. Sea-level muons are propagated to a rock layer above the detector using Geant4 to find the muon energy spectrum and angular distribution at depth. The simulation spectrum are compared to Miyake’s phenomenological estimation and to experimental measurement made at the mine. ### IV.1 Muon Shower Equilibrium Cosmic ray muons are capable of penetrating to significant depths underground. At depth, these muon produce a myriad of particles, including photons, electrons, and hadrons. Other cosmic ray particles and those produced as the muon passes through the rock can travel only a short distance, 2 m, in the rock. This short path length allows for a simplification of the neutron production modeling because the full simulation does not need to start at sea level, but only a few meters above the detectors laboratory hall. To find the path length after which the muon-induced showers come into equilibrium, muons with energy between 100 GeV to 10 TeV are propagated through standard rock composition but having density 2.85 g/cm3. The reported observables are in the transverse plane to the muon’s initial momentum as a function of the distance from the muon’s entry into a 10 m thick rock layer. Figure 4 shows the results of the Geant4 simulation. All the observables are evaluated on transverse planes to the muon’s path. For all distributions, an equilibrium state is achieved within 2 m of rock in all ranges of muon energy. In Figure 4 (b), the distribution is not zero when the thickness is zero. This effect occurs due to back-scatter from rock deeper along the muon’s path. While secondary particle production quickly comes into equilibrium there is a concern that secondary muons may have a longer attenuation length than the equilibrium length of the dominating hadronic and electromagnetic components. If so, it would cause an additional muon flux on the Pb-target beyond the sea level component propagated to depth. If a 2.5 GeV cutoff is used, equivalent to the minimum ionizing dE/dx energy loss of a muon passing through 4m of rock, it is found that secondary muons produced by primary muons with 100 GeV, 1 TeV, and 10 TeV, having a path length greater than 4m is less than 10-5, 10-4, 10-3, allowing this secondary source of neutron production in the Pb-target to be neglected. From these consideration it is concluded to start the full muon shower simulation in a horizontal plane 4 m above the detector’s cavern hall. Doing so captures the effects of (i) secondary particle production due to the entire mines over burden, (ii) the secondary particle contribution to neutron production in the nearby target hall rock, and (iii) secondary particle interactions within the lead target. ### IV.2 Muon Propagation from Sea Level to Depth No at depth experimental or analytical correlated distributions are available. To correctly model the correlated angular and energy distribution of muons at depth, a propagation model must be used starting with the known correlated distributions at sea level [16], | (2) | and propagating individual muons to depth. The validity of the Geant4 propagation model will be checked by (1) using Miyake’s empirical model to compare separately the muon flux density and angular distributions as a function of depth and (2) using the mine muon intensity measurements as a function of depth. The depth in m.w.e. is obtained from a CUPP group’s unpublished simulation model. Formula (2) is valid when muon decay is negligible (100/cos GeV) and the curvature of the Earth can be neglected (). Fortunately, the two limitations do not influence the muon spectrum at 583 m.w.e. and 1166 m.w.e. underground. As is discussed in Appendix A, muons not suitable for formula (2) will not pass through the thick 583 m.w.e. rock layer. In the Geant4 model, muons are scattered in the standard rock, lose energy, create shower particles, and can suffer catastrophic energy loss. Standard rock with density 2.65 is used in this cosmic ray propagation model because the CUPP reported depth in m.w.e. can be directly converted to the depth in standard rock by definition. The muons are propagated from sea level to 4 m above the laboratory. Only muons are tracked to save simulation time. Shower particles are not tracked once generated. Finally, at depth, the muon’s new energy (E’), and angles ( and ) are recorded, having the required energy-angular correlation. The generated underground energy and angular spectra are shown in Figure 5. The mean muon energy at 571.6 m.w.e. is 95.6 GeV and at 1154.6 m.w.e. is 158.7 GeV. The total muon induced event number during the experiment at 571.6 m.w.e. is times that collected at 1154.6 m.w.e.. Figure 6 shows the Geant4 calculated muon energy flux density at depth as a function of angle for the two locations of the detector 4m above the detector halls. ### IV.3 Geant4 and Miyake Formula Comparison The underground intensity of muons can be calculated with the widely used empirical formula of Miyake. At intermediate depths (100 m.w.e. to 4000 m.w.e.), the Miyake formula is given by [17] | (3) | where, A is the only free parameter and X is in m.w.e.. A was found by fitting measurements made at the Pyhasälmi mine above and below the experiment[18]. The flux density measurements are presented in Appendix B. The fit returned . The muon cosmic ray flux density generated by the Geant4 Model and predicted by Miyake’s formula along with the measurements are compared as a function of depth in Figure 7. The muon flux normalization at 4 m rock above the experimental cavities are compared in Table 1. Also shown is the experimental underground muon cosmic ray density at 571.6 m.w.e. and 1154.6 m.w.e. extrapolated between measured points using a 5 free parameters version of the Miyake formula. | (4) | The comparison yields an average difference of over the range, 500 m.w.e. to 1200 m.w.e.. | | | | |||||||| |---|---|---|---|---|---|---|---|---|---|---|---| | 571.6 | 0.114 | 0.123 | 0.105 | |||||||| | 1154.6 | 0.0154 | 0.0148 | 0.0148 | The muon angular distribution formula of Miyake[17] is given by, | (5) | where is the vertical intensity at depth X. The underground muon angular distributions predicted by the Monte Carlo and Miyake’s formula are compared at the two experimental depths in Figure 8. At the two experimental locations the averaged rms difference between the two distributions is less than 1%. ### IV.4 Charge Ratio of the Surface Muons The final input to the Monte Carlo simulation is the charged muon flux ratio. At depth, for low energy muons, E1 GeV, the cross section with lead is larger than the due to attraction with the nucleus. For higher energy muons, E1 GeV, the cross sections is nearly charge independent. This effect is displayed in Table 2. The average generated neutron number and the reaction probability for muons incident on a 30 cm cube lead target is also shown. The reaction probability is the probability of generating at least one neutron. To correctly take into account the effects of the muon flux charge ratio, the and Geant4 simulation are separately modeled. Only at the end of the complete simulation are they recombined using a single charge ratio value. At 583 m.w.e. depth, muons GeV require a minimum energy of GeV at sea level to propagate to this level. Likewise at 1166 m.w.e. depth, an energy of GeV is required. Because the to ratio at the surface between 100 GeV and 500 GeV is constant, the value [19] is selected. The estimated charge ratio for higher energy muons is less than the error of the selected value. | Energy | 100 MeV | 1 GeV | 10 GeV | || |---|---|---|---|---|---| | 4.9 | 4.7 | 6.2 | ||| | 0.87 | 0.0013 | 0.012 | || | 1.4 | 4.3 | 6.5 | ||| | 0.0034 | 0.0014 | 0.011 | ## V Neutron Production Simulation ### V.1 Geant4 Model All muon and secondary particle processes in the rock and lead are simulated with Geant4-11.01 using the physics list QGSP-BERT-HP. This list was selected based on its use for LHC experiments. In particular ATLAS and CMS have studied the physics performances of the physics lists and converged on the use of the QGSP-BERT physics list as the most comprehensive and thus the default [20]. ### V.2 Model Simulation Universe The Geant4 simulation begins full shower modeling starting in a horizontal layer 4m above the laboratory hall. Muon generated showers are fully developed allowing the shower particles to interact with the lead target and detector system to generate neutrons. The model universe is displayed in Figure 9. The NMDS-II detector system, is centered on the floor inside a cavity () surrounded by rock. The horizontal thickness of each of the universe’s rock side walls is 53 meters. The cavity rests on and is capped by a 4m thick rock floor and roof. Both extend to the outer edges of the side walls forming a rectangular cube. The dimensions were chosen to assure cosmic ray muons with angles from 0 degree to 85.5 degree intersect the top of the universe’s roof. The number of slant angle muons passing through the target not covered by this angular range is smaller than 1 over the course of the experiment. The Geant4 simulation inputs are then, (1) the muon flux intensity at depth, (2) the correlated muon energy and angular distribution at depth and finally, (3) the cosmic ray muon charge ratio. The full simulation starting point is the universe’s top surface or roof, . The total number of muon events intersecting the universe’s roof in the experiments live times are shown in Table 3. The values are found using Eq. 4, Miyake’s fit to the experimentally measured [18] muon flux density values, shown in Table 1. In order that the simulations have superior statistics compared to the data, more than 10 times the experimental statistics were simulated, also displayed in Table 3. | Depth | 583 m.w.e. | 1166 m.w.e. | |---|---|---| | Live Time hrs | 6504 | 1440 | | -Experiment | || | -Simulation | ### V.3 Full Event Simulation Trigger Because of the large size of the simulation universe and the corresponding low interaction rate of cosmic ray showers with the experiment’s detectors, a simulation trigger was developed to further reduce the required computational run time. Once the simulation located a muon on the roof of the universe, using its initial angular parameters the muon track was pointed at the target. The intersection of the muon track with a spherical surface virtual detector was checked and the event was rejected from further consideration if not intersecting the virtual detector. This virtual detector forms a MC trigger for which muons will be fully simulated as they pass through or nearby the target. Figure 10 illustrates the geometry of the model. For an accurate simulation, it is critical that the event selection virtual detector should be given an appropriate size. Otherwise, some events with neutrons detected will be mis-rejected if the size is too small. However, computing time is roughly proportional to the volume of the virtual detector, or . Too much computing time will be taken if the event selection virtual detector is too large. To optimize the radius of the virtual trigger detector, simulations were performed to study the number of detected neutrons as a function of the virtual detector radius, ranging from 30 cm to 360 cm. In the region where the neutron multiplicity exceeds 4, all curves with a radius R 300 cm are indistinguishable using 10 times experimental statistics, while those with R 300 cm remain distinct from one another. Based on these results, a virtual trigger detector radius of R = 300 cm was selected as the optimal value. ### V.4 Simulation Statistical Errors Finally, once a muon is accepted by the virtual trigger, a full shower simulation is completed. In order to get the average response of the NMDS-II 3He neutron detector system, the neutrons hit times on the 3He tubes were re-sampled 100 times. The statistical errors for the simulations detected neutron multiplicity are estimated using a Bootstrapping method[21]. ## VI Experimatal and Simualtion Data Analysis ### VI.1 The Mechanism of Neutron Multiplicity’s Power Law Distribution When a high-energy muon and/or its associated shower particles enters the NMDS-II lead target, a neutron cascade can be initiated. The Pb-target can be thought of as a many-body quantum system with the initial cascade particles having been promoted to a highly excited quantum state. As the cascade or avalanche progresses, the lower-energy quantum states are excited until neutron production is exhausted. After each neutron emission, the number of possible remaining transitions decreases, making the process irreversible and reducing the available quantum states. This cascade process closely matches a sample-space-reducing (SSR) process, where each step in the cascade narrows the system’s future possible states. Importantly, SSR processes are known to naturally generate power-law distributions, [22], with the index remaining independent of nuclear structure and reaction type[23]. In the case of muon-induced neutron cascades, this means the distribution of the number of emitted neutrons or the energy released is expected to follow a power law. Many exponents for cascades or avalanche-like processes are found within a range of . where p represents the multiplicity factor of the average transition probability at each step in the cascade. The relationship between cascade processes and universal power-law distributions is based on two fundamental principles: the stochastic nature of transition rates and the exponential energy dependence of the level density in fermionic many-body systems[23]. It is also proved that the exponent index p should be 2 if the energy is conserved[24, 23]. However, in the case of neutron generation in lead target, the energy deposited in the lead target is not necessarily released solely through neutrons. As a result, the spectrum may decay more rapidly, implying that . For instance, the exponent parameter value is 2.4 in solar neutron emissivity [25]. ### VI.2 NMDS-II Simulation and Experimental Data Power Law Fitting The MNDS-II neutron multiplicity experimental data as well as Geant4 simulations results are independently displayed in Figure 11. These data are indepentently fit using a two parameter power law, . These fits are compared with data and used later for the dark matter search to account for the cosmic ray background. At 583 m.w.e., a multiplicative 5.6% systematic error at each experimental point was included and placed in quadrature with the statistical error. The additional error is due to deterioration of the 3He tube over the course of data collection. As the case with the simulation, the data fit well to a power law yielding /DoF = 0.72 for 54 degrees of freedom. Likewise, the Geant4 simulation results fit a power-law well with /DoF = 1.24 at 583 m.w.e. and /DoF = 1.24 for the 1166 m.w.e.. For the data at 1166 m.w.e. a Maximum Likelihood Estimation (MLE) method is used to measure the power law parameters for the data whose neutron multiplicity is equal to or larger than 5 because there are only 6 points in the data set. In addition, the multiplicity probability distribution is normalized to one, yielding a single-free parameter fit for the index p. The fit then yields p=2.13 with an only slightly asymmetric Gaussian shaped Likelihood distribution having 0.37. The fitting and MLE results for NMDS-II experimental data and Geant4 simulation are summarized in Table 4. As expected for SSR processes, the index value p, within errors, are in agreement for the Geant4 Monte Carlo simulations and the data. Likewise, we expect the p value to be close to 2.4, as obtained from solar the neutron spectrum. ### VI.3 Errors in the Simulation Model The Geant4 simulation agrees with the experimental data in the exponent parameter p but not in the amplitude parameter k. The difference in k parameter between the Geant4 simulation and experimental data is mainly caused by the systemaic error in the simulation, such as the error of muon-lead cross section. However, even if there are systematic errors in the simulations, it is not surprising that the simulations and experimental data agree in p due to the characteristics of the SSR process. The difference in k parameter or the amplitude between the Geant4 and FLUKA simulations is a measure of their systematic error. Muon mean energy at 583 m.w.e. is 95 GeV, with corresponding mean neutron production ratio Geant4/FLUKA and muon mean energy at 1166 m.w.e. is 160 GeV, with corresponding ratio Geant4/FLUKA . This systematic error in mean neutron number produces a larger error in the amplitude parameter. This effect can be illustrated by scaling the neutron production by a factor , which leaves the power law invariant, but significantly affects the amplitude, as shown in the formula (6), | (6) | This shows that the amplitude parameter k is too sensitive to systematic errors in the simulation, making the comparison between the data and the simulation in this parameter unavailing. | | p | | ||||||| |---|---|---|---|---|---|---|---|---|---|---| | 583 | 6504 | Geant | | 1.24 | |||||| | Exper | | 0.72 | |||||||| | 1166 | 1440 | Geant | | 1.24 | |||||| | Exper | | 0.76 | The distribution of neutron multiplicity for the data sets and simulations is shown independently of k in Figure 12 by fixing k at an arbitrary value. If the power law index p changes as a function of depth, it is a slow change. ## VII Dark Matter Search Method Because it is assumed that DM-M cross sections are extremely small, the dark matter flux is expected to be independent of depth. However, the sensitivity to DM neutron production is not the same at both depths. The cosmic ray flux is reduced by a factor of at the 1166 m.w.e level compared to the 583 m.w.e. depth. In addition the data collection time was 4.5 times longer at the 583 m.w.e. level. Even so, if all the events collected at the 1166 m.w.e. level are assumed to be DM induced events, only % of the events at the 583 m.w.e. level would be DM matter induced events. Due to the much larger background at the 583 m.w.e. level the dark matter-matter search is based on neutron multiplicity event data collected at 1166 m.w.e.. In this dark matter search, it is assumed that the cosmic ray neutron multiplicity distributions have a common power law index. A normalized probability function is produced consisting of the combination of the cosmic ray induced neutron production spectrum, and a DM hadronic neutron production model spectrum | (7) | From this the likelihood function is formed, | (8) | where is the data spectrum at 1166 m.w.e. and the p parameter is set to the simulation value at 1166 m.w.e. found in Table 4. The significance , of any DM signal , in standard deviations is, | (9) | where is the cosmic ray induced background, is the most likely model dependent value of the likelihood function, and is the total number of events in the neutron multiplicity spectrum at 1166 m.w.e.. ## VIII Dark Matter Models In this search, for simplicity it is assumed the complete dark matter particle’s mass-energy is deposited hadronicly in the target. For example, a neutrino can transfer a fraction of its mass energy into hadronic energy. In this case a differing model depositing an on-average-fractional energy merely causes a shift in the DM converted energy in these simulations by an amount | (10) | Two extreme models are used to simulate the interaction process. A spallation model in which the DM mass energy is converted into the kinetic energy of a single proton and a pion fireball model in which the net momentum is zero. Geant4 is used to propagate the secondary particles, create neutrons in the target, and then follows each neutron for detection in the tube. In the acceptance calculation it is assumed dark matter - matter interactions happen at a random location inside the lead target. In both the simulations and the experimental data analysis a minimum of 5 observed neutrons are required in order to assure that radioactivity in the surround rock is eliminated as a source or cause of an event. Unlike neutron production from high-energy muon interactions with lead, hadronic neutron production from proton–lead or pion–lead interactions is better understood, allowing for more precise simulations. For validation the spallation model simulation was compered to the NESSI(Neutron Scintillator and Silicon Detector) experimental results[27][28] in the range 1.2 GeV to 2.5 GeV. The experimental neutron production and the simulation are in agreement at the 10% level[29]. ### VIII.1 Spallation Model The process of dark matter energy deposition in the lead target is modeled using a proton induced spallation model to break apart the target nuclei. In the model, the proton’s kinetic energy is set equal to the mass-energy of the dark matter particle. The dark matter events are uniformly distributed throughout the lead target, and the protons’ momentum vectors are selected to be isotropic at their creation point. In the simulation neutron production is measured by the creation of an particle in the tube. For the DM simulation the resulting unnormalized neutron multiplicity events distributions are displayed in Figure 13 as a function of a fixed converted DM mass-energy. From these simulations the acceptance for the spallation model is presented in Figure 14. In this model the acceptance does not plateau at 1 because near the edges of the target the momentum of the proton can point away from the target reducing the probability of an acceptable event. ### VIII.2 Fireball Model A hadronic fireball is an intermediate state created immediately after a collision or an annihilation like process. To contrast it with the spallation model the fireball is created at rest composed completely of pions as the initial secondary particles. In the simulation charge is conserved in the creation of pions(). The pion kinetic energy, E distribution is assumed to follow the Planck distribution, | (11) | where dN represents the number of particles in the energy range E to E + dE, A is the normalization coefficient and kT = 0.165 GeV [30]. In the acceptance calculation all the pions of a single event are generated at the same point. The events are uniformly distributed throughout the lead target. While each pion momentum vector is selected isotropically, the total momentum of an event is not required to be conserved. Geant4 is used to propagate the pions in the lead, creating and tracking secondary particles and finally to register the detection of neutrons in the tubes. The resulting fireball model neutron multiplicity events distributions for a fixed DM mass-energy deposition is displayed in Figure 15. Again the acceptance curve is displayed in Figure 14. The acceptance plateaus at 1 because even near the edge of the Pb-target the uniform angular distribution of the pions assures some energy is always moving inwards. ## IX Dark Matter Signal Search The results of combining the cosmic ray background neutron multiplicity shape with the Geant4 neutron DM induced multiplicity distribution shapes through the likelihood function, Equations 8 and 9, are shown in Figure 16. The search for excess neutron multiplicity production is conducted using the data at 1166 m.w.e. displayed in Figure 11. For the search, is limited to the physical positive signal region [0,1] and is the signal significance. There are mass regions in Figure 16 in both models for which the most likely projection of the DM induced hadronic energy deposition yields zero in the likelihood function. This is most notable at high observed DM energy deposition above 20 GeV. For low energy deposition less than 2 GeV the detector loses its sensitivity as the DM matter induced neutron multiplicity events distribution shape becomes more cosmic ray like. There is a peak-like shape in the signal significance between 2 GeV to 20 GeV. The top of the peak for both models is a approximately 1.5, corresponding to 4 excess events. The significance is not large enough to claim a dark matter signal. ## X Dark Matter Cross Section Upper Limits It is assumed that DM particles are distributed uniformly and are at rest, in other words, they have no angular momentum relative to the galactic center. The velocity of the Dark Matter flux around the earth has two components in the earth frame: the speed derived due to the sun about the galaxy and the motion of the earth relative to the sun. In this search the small variation caused by the earth’s motion is discarded. The number of DM particles passing through the lead target during data collection is expressed by | (12) | where is the local DM density(), v is the rotation velocity of the sun(), t is the experiment’s live acquisition time (1440 hours) and is the cross section of the lead target(). The number of expected dark matter - matter conversion events is then given by | (13) | Where for the 30 cm cubic Pb-target. is the cross section of dark matter interacting with a nucleus converting all its mass-energy into hadronic-energy. The model dependent 90% upper limits, are found by integrating the normalized asymmetric likelihood function, Equation 8, over from zero to 90%. From these results and inverting Equation 13, the 90% confidence cross section upper limits are given by | (14) | where is the model dependent acceptance and A is the atomic number. Four limit cases are presented in Figure 17. Spin dependent and independent limits based on the fireball and spallation models. For spin-independent cross sections, the sensitivity per nucleon requires dividing the factor of the atomic number , twice. The first factor of A is simply due to the target nucleon number. The second factor occurs because the De Broglie wavelength of an at rest DM particle with mass less than 100 GeV is larger than the lead nuclear dimensions used as the target, meaning the dark matter particles interact with the nucleus as a whole. This large enhancement factor is the motivation for the use of the instrumented Pb-target. For spin-dependent cross sections, the sensitivity per nucleon results in a single factor of A because the interaction only take places with a single nucleon. The upper limits displayed in Figure 17 are based on complete conversion (a fixed delta function) of the DM mass-energy into hadronic energy. ## Acknowledgement The authors thank Dr. Thomas Ward from TechSource, Inc for providing the data at NMDS-II experiment and giving us useful advice in the discussion. We thank Dr. Norbert Neumeister and Purdue CMS group for allowing use of excess cluster cycles. This work was funded under a grant from the U.S. Department of Energy Office of Nuclear Energy, Contract No. DE-SC0007884, Department of Physics and Astronomy at Purdue University and TechSource Inc. ## Appendix A Muon Energy Loss in the Rock Muons lose energy by ionization and by three radioactive processes; bremsstrahlung, production of electron-position pairs and photonuclear interactions. The muon energy loss was calculated using the form [16], | (15) | where is the ionization loss and is the sum of the three fractional radiative losses. Both are slowly varying functions of muon energy as shown in Table 5 for standard rock. A second-order polynomial was used to fit and , each independently, as a function of , yielding the fits values, | (16) | | (17) | with only 1 degree of freedom. These values are input in Equation (15) yielding the point-by-point transformation of the surface energy distribution to one at depth. | R | a | |||||| | GeV | km.w.e | |||||| | 10 | 0.05 | 2.17 | 0.70 | 0.70 | 0.50 | 0.0088 | 0.219 | | 100 | 0.41 | 2.44 | 1.10 | 1.53 | 0.41 | 0.1246 | 0.274 | | 1000 | 2.45 | 2.68 | 1.44 | 2.07 | 0.41 | 1.463 | 0.660 | | 10000 | 6.09 | 2.93 | 1.62 | 2.27 | 0.46 | 14.85 | 4.643 | The validity of this formulation when propagated to NMDS-II depth is supported by a comparison of the formulation and measured data[16], displayed together in Table 6. | Measured | Predicted | Difference | | |---|---|---|---| | 10 | 50 | 48.7 | 2.6 % | | 100 | 410 | 409 | 0.24 % | | 1000 | 2450 | 2455 | 0.21 % | | 10000 | 6090 | 6500 | 6.3 % | The predicted average muon range in Table 6 is obtained by numeral calculations. The muon path in the rock is divided into many small steps. Muon energy loss at each step is then | (18) | The length of each step was taken to be m.w.e., and is found from Equation (15). The energy of the muon is changed in each step, so that a in (16) and b in (17) are also changed. The predicted muon average range in Table 6 is the total length of the muon path in the rock when the energy becomes 0. The slant angle calculated flux and experimental flux is in agreement in the high energy region below the muon cutoff energy or range, shown as a horizontal line (blue) in Figure 18 and listed in Table 7. The highest energy events estimated to be observed by the detector is 10 TeV, limiting the slant angle to cos(0.05. The curvature of the Earth was taken into account in these calculations. Figure 18 shows the cosmic ray muon spectrum predicted by the sea level muon density Formula (2) and from measured data [31] as a function of cos. cos is chosen as 0.6, 0.4, 0.3, 0.2, 0.1 and 0.05. Only the muons in the part to the right of the blue bar are able to pass through the rock and propagate to 583 m.w.e.. Thus from the Figure 18, the muon flux density predicted by Formula (2) matches well with the experimental data. | E | E | ||| |---|---|---|---|---| | (GeV) | Cutoff (GeV) | Cutoff (GeV) | || | 1.00 | 100 | 149 | 137 | | | 0.60 | 167 | 275 | 234 | | | 0.40 | 250 | 463 | 358 | | | 0.30 | 333 | 695 | 484 | | | 0.20 | 500 | 1330 | 740 | | | 0.10 | 1000 | 6045 | 1526 | | | 0.05 | 2000 | 87800 | 3144 | | | 0.00 | - | ## Appendix B CUPP Muon Flux Density as a Function of depth | Depth | Flux Density | |---|---| | [m.w.e.] | [] | | 0 | | | 210 | | | 420 | | | 980 | | | 1900 | | | 2810 | | | 3960 | ## References - Group *et al.*[2022] P. D. Group, R. Workman, V. Burkert, V. Crede, E. Klempt, U. Thoma, L. Tiator, K. Agashe, G. Aielli, B. Allanach,*et al.*, Review of particle physics, Progress of theoretical and experimental physics 2022, 083C01 (2022). - Aalbers *et al.*[2022] J. Aalbers, S. AbdusSalam, K. Abe, V. Aerne, F. Agostini, S. A. Maouloud, D. Akerib, D. Y. Akimov, J. Akshat, A. Al Musalhi,*et al.*, A next-generation liquid xenon observatory for dark matter and neutrino physics, Journal of Physics G: Nuclear and Particle Physics 50, 013001 (2022). - Akerib *et al.*[2021] D. Akerib, S. Alsum, H. Araújo, X. Bai, J. Balajthy, A. Baxter, E. Bernard, A. Bernstein, T. Biesiadzinski, E. Boulton,*et al.*, Effective field theory analysis of the first lux dark matter search, Physical Review D 103, 122005 (2021). - Albakry *et al.*[2022] M. F. Albakry, I. Alkhatib, D. Amaral, T. Aralis, T. Aramaki, I. Arnquist, I. A. Langroudy, E. Azadbakht, S. Banik, C. Bathurst,*et al.*, A strategy for low-mass dark matter searches with cryogenic detectors in the supercdms snolab facility, arXiv preprint arXiv:2203.08463 (2022). - Akerib *et al.*[2017] D. Akerib, S. Alsum, H. Araújo, X. Bai, A. Bailey, J. Balajthy, P. Beltrame, E. Bernard, A. Bernstein, T. Biesiadzinski,*et al.*, Results from a search for dark matter in the complete lux exposure, Physical review letters 118, 021303 (2017). - Cui *et al.*[2017] X. Cui, A. Abdukerim, W. Chen, X. Chen, Y. Chen, B. Dong, D. Fang, C. Fu, K. Giboni, F. Giuliani,*et al.*, Dark matter results from 54-ton-day exposure of pandax-ii experiment, Physical review letters 119, 181302 (2017). - Collaboration *et al.*[2018] X. Collaboration, E. Aprile, J. Aalbers, F. Agostini, M. Alfonsi, L. Althueser, F. Amaro, M. Anthony, F. Arneodo, L. Baudis,*et al.*, Dark matter search results from a one ton-year exposure of xenon1t, Physical review letters 121, 111302 (2018). - Doro *et al.*[2013] M. Doro, J. Conrad, D. Emmanoulopoulos, M. A. Sànchez-Conde, J. Barrio, E. Birsin, J. Bolmont, P. Brun, S. Colafrancesco, S. Connell,*et al.*, Dark matter and fundamental physics with the cherenkov telescope array, Astroparticle Physics 43, 189 (2013). - Abbasi *et al.*[2023] R. Abbasi, M. Ackermann, J. Adams, S. Agarwalla, J. Aguilar, M. Ahlers, J. Alameddine, N. Amin, K. Andeen, G. Anton,*et al.*, Search for neutrino lines from dark matter annihilation and decay with icecube, Physical Review D 108, 102004 (2023). - Adrián-Martínez *et al.*[2016] S. Adrián-Martínez, A. Albert, M. André, G. Anton, M. Ardid, J.-J. Aubert, T. Avgitas, B. Baret, J. Barrios-Martí, S. Basa,*et al.*, Limits on dark matter annihilation in the sun using the antares neutrino telescope, Physics Letters B 759, 69 (2016). - Kudryavtsev *et al.*[2008] V. A. Kudryavtsev, L. Pandola, and V. Tomasello, Neutron- and muon-induced background in underground physics experiments, Eur. Phys. J. A 36, 171 (2008), arXiv:0802.3566 [astro-ph] . - Lovchikova *et al.*[2004] G. Lovchikova, A. Trufanov, M. Svirin, V. Vinogradov, and A. Polyakov, Spectra and mean energies of prompt neutrons from 238 u fission induced by primary neutrons of energy in the region e n¡ 20 mev, Physics of Atomic Nuclei 67, 1246 (2004). - Lestone [2014] J. Lestone, A comparison between two evaluations of neutron multiplicity distributions, arXiv preprint arXiv:1410.2148 (2014). - Knoll [2000] G. E. Knoll, *Radiation Detection and Measurement*(John Wiley and Sons, Inc., 2000) Chap. 14, pp. 518–519. - Shalev *et al.*[1969] S. Shalev, Z. Fishelson, and J. Cuttler, The wall effect in the counters, Nuclear Instruments and Methods 71, 292 (1969). - J.J. Beatty [2019] S. W. J.J. Beatty, J. Matthews, Review of particle physics - cosmic rays, Progress of Theoretical and Experimental Physics 2019, 083C01 (2019). - KF [2001] P. KF, *Cosmic rays at Earth: researcher’s reference manual and data book*(Elsevier, 2001) Chap. 4, pp. 485–486. - Enqvist *et al.*[2005] T. Enqvist, A. Mattila, V. Föhr, T. Jämsén, M. Lehtola, J. Narkilahti, J. Joutsenvaara, S. Nurmenniemi, J. Peltoniemi, H. Remes,*et al.*, Measurements of muon flux in the pyhäsalmi underground laboratory, Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment 554, 286 (2005). - Khachatryan *et al.*[2010] V. Khachatryan, A. M. Sirunyan, A. Tumasyan, W. Adam, T. Bergauer, M. Dragicevic, J. Erö, C. Fabjan, M. Friedl, R. Fruehwirth,*et al.*, Measurement of the charge ratio of atmospheric muons with the cms detector, Physics Letters B 692, 83 (2010). - Kiryunin *et al.*[2006] A. Kiryunin, H. Oberlack, D. Salihagić, P. Schacht, and P. Strizenec, Geant4 physics evaluation with testbeam data of the atlas hadronic end-cap calorimeter, Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment 560, 278 (2006). - Johnson [2001] R. W. Johnson, An introduction to the bootstrap, Teaching statistics 23, 49 (2001). - Corominas-Murtra *et al.*[2015] B. Corominas-Murtra, R. Hanel, and S. Thurner, Understanding scaling through history-dependent processes with collapsing sample space, Proceedings of the National Academy of Sciences 112, 5348 (2015), https://www.pnas.org/doi/pdf/10.1073/pnas.1420946112 . - Fujii and Berengut [2021] K. Fujii and J. C. Berengut, Power-law intensity distribution of -decay cascades: Nuclear structure as a scale-free random network, Physical Review Letters 126, 102502 (2021). - Corominas-Murtra *et al.*[2017] B. Corominas-Murtra, R. Hanel, and S. Thurner, Sample space reducing cascading processes produce the full spectrum of scaling exponents, Scientific Reports 7, 11223 (2017). - Chupp *et al.*[1987] E. Chupp, D. Forrest, G. Kanbach, E. Flueckiger, and F. Golliez, Solar neutron emissivity during the large flare on 1982 june 3, Astrophys. J. 318 (1987). - Bauche-Arnoult and Bauche [1997] C. Bauche-Arnoult and J. Bauche, Comparison of atomic data modeling with experimental intensities, Journal of Quantitative Spectroscopy and Radiative Transfer 58, 441 (1997), radiative Properties of Hot Dense Matter III. - Filges *et al.*[2001] D. Filges, F. Goldenbaum, M. Enke, J. Galin, C.-M. Herbach, D. Hilscher, U. Jahnke, A. Letourneau, B. Lott, R.-D. Neef,*et al.*, Spallation neutron production and the current intra-nuclear cascade and transport codes, The European Physical Journal A-Hadrons and Nuclei 11, 467 (2001). - Letourneau *et al.*[2000] A. Letourneau, J. Galin, F. Goldenbaum, B. Lott, A. Péghaire, M. Enke, D. Hilscher, U. Jahnke, K. Nünighoff, D. Filges,*et al.*, Neutron production in bombardments of thin and thick w, hg, pb targets by 0.4, 0.8, 1.2, 1.8 and 2.5 gev protons, Nuclear Instruments and Methods in Physics Research Section B: Beam Interactions with Materials and Atoms 170, 299 (2000). - Cao [2023] H. Cao, *Indirect Dark Matter Search for Dark Matter*, Ph.D. thesis, Purdue University (2023). - Saha *et al.*[1987] A. Saha, M. Samanta, D. Pal, R. Nandy, and B. Bandopadhyay, Energy distribution of pions in the nucleon–nucleus interaction at 70 gev, Canadian Journal of Physics 65, 527 (1987). - Lipari and Stanev [1991] P. Lipari and T. Stanev, Propagation of multi-tev muons, Physical Review D 44, 3543 (1991).",
    "sections": {
      "abstract": "esponding Author: koltick@purdue.edu] # Dark Matter Induced Neutron Production Search Limits ###### Abstract An independent indirect detection search for Dark Matter-Matter (DM-M) interactions is undertaken to set cross section limits based on neutron production data collected by the NMDS-II detector for 1440 hours at 1166 m.w.e. and 6504 hours at 583 m.w.e.. The detector system consists of a 30 cm cube Pb-target instrumented with 60 3He neutron counters. The neutron detector system calibrated with a 252Cf source yields a single particle detection efficiency of 23.2%1.2%. During data collectio",
      "introduction": "l 10. Spin dependent limits, proportional to A-1, are at the level, . † †preprint: APS/123-QED ## I Introduction The nature of dark matter has been one of the most intriguing problems in fundamental physics and cosmology. Based on the standard model of cosmology, the total mass-energy of the known universe contains 4.9% ordinary matter, 26.8% dark matter and 68.3% dark energy [1]. Although there is extensive evidence of dark matter in astrophysical observations, dark matter particles have not been detected. Dark matter searches can use direct or indirect detection methods. Present WIMP Dark Ma",
      "methodology": "matter particles have not been detected. Dark matter searches can use direct or indirect detection methods. Present WIMP Dark Matter (DM) search strategies are focused on possible direct detection through elastic or inelastic scatterings on atomic nuclei, or with electrons. This approach become insensitive to M10 GeV. The XENON series [2], LUX [3] and SuperCDMS [4] are some notable dark matter direct detection experiments. For mass GeV direct detection methods [5, 6, 7] yield DM-nucleon cross section limits of order . Indirect DM detection refers to the search for the annihilation or decay de",
      "results": "amma observations from the Cherenkov Telescope Array[8], neutrino observation from IceCube [9], and results from the ANTARES Telescope [10]. However, for low-mass dark matter particles, , the sensitivities for DM-M or DM-DM couplings are poor in both current direct detection searches and indirect detection searches. This situation can be improved by the search for DM-M interactions observable through excess high multiplicity neutron production in nuclear targets. Even for M 10 GeV DM-M annihilation is capable of producing large signals, 200 neutrons if the energy is deposited in a Pb-target. F",
      "conclusion": "rom TechSource, Inc for providing the data at NMDS-II experiment and giving us useful advice in the discussion. We thank Dr. Norbert Neumeister and Purdue CMS group for allowing use of excess cluster cycles. This work was funded under a grant from the U.S. Department of Energy Office of Nuclear Energy, Contract No. DE-SC0007884, Department of Physics and Astronomy at Purdue University and TechSource Inc. ## Appendix A Muon Energy Loss in the Rock Muons lose energy by ionization and by three radioactive processes; bremsstrahlung, production of electron-position pairs and photonuclear interactio"
    },
    "word_count": 8120,
    "sentence_count": 527,
    "sentences": [
      "Corresponding Author: koltick@purdue",
      "edu] # Dark Matter Induced Neutron Production Search Limits ###### Abstract An independent indirect detection search for Dark Matter-Matter (DM-M) interactions is undertaken to set cross section limits based on neutron production data collected by the NMDS-II detector for 1440 hours at 1166 m",
      "and 6504 hours at 583 m",
      "The detector system consists of a 30 cm cube Pb-target instrumented with 60 3He neutron counters",
      "The neutron detector system calibrated with a 252Cf source yields a single particle detection efficiency of 23",
      "During data collection, the highest neutron multiplicity event observed 54 neutrons",
      "The neutron multiplicity, n, distribution, fits well to a power law , for both the data and cosmic ray muon induced neutron production in Geant4 simulations",
      "Two DM-M interaction models were used to set limits",
      "The first, a spallation model, assumes a single proton with kinetic energy equal to the DM-M interaction energy",
      "The other, a fire-ball model assumes an annihilation between DM-M producing pions with a limiting Hagedorn temperature",
      "The two extreme models produce similar upper DM-M cross section limits over the DM mass range between 300 MeV to 100 GeV",
      "Limits assume all the DM energy is deposited in the Pb-target",
      "Spin independent limits, proportional to A-2, are at the level 10",
      "Spin dependent limits, proportional to A-1, are at the level,",
      "† †preprint: APS/123-QED ## I Introduction The nature of dark matter has been one of the most intriguing problems in fundamental physics and cosmology",
      "Based on the standard model of cosmology, the total mass-energy of the known universe contains 4",
      "9% ordinary matter, 26",
      "8% dark matter and 68",
      "3% dark energy [1]",
      "Although there is extensive evidence of dark matter in astrophysical observations, dark matter particles have not been detected"
    ],
    "character_count": 48935
  },
  "embedding_metadata": {
    "content_type": "academic",
    "relevance_score": 1.0,
    "language": "en",
    "source_type": "web",
    "processing_version": "2.0",
    "extraction_method": "trafilatura"
  }
}