{
  "metadata": {
    "url": "https://timesofindia.indiatimes.com/india/tmc-jaabe-hobe-poribortan-in-kolkata-pm-modis-big-charge-and-a-promise-top-quotes/articleshow/123456096.cms",
    "title": "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise -...",
    "domain": "timesofindia.indiatimes.com",
    "extraction_date": "2025-08-22T22:13:04.960800",
    "content_quality": "medium",
    "quality_score": 0.8,
    "content_type": "article"
  },
  "content": {
    "title": "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise -...",
    "summary": "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise - top quotes Trending NEW DELHI: Prime Minister Narendra Modi on Friday launched a full-blown attack against West Bengal chief minister Mamata Banerjee and pledged a \"poribortan\" from the Trinamool Congress government.While addressing a rally in Kolkata, the prime minister accused the West Bengal government of diverting money sent by the Centre towards TMC cadres.Here are the top quotes from PM Mod...",
    "full_text": "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise - top quotes Trending NEW DELHI: Prime Minister Narendra Modi on Friday launched a full-blown attack against West Bengal chief minister Mamata Banerjee and pledged a \"poribortan\" from the Trinamool Congress government.While addressing a rally in Kolkata, the prime minister accused the West Bengal government of diverting money sent by the Centre towards TMC cadres.Here are the top quotes from PM Modi's speech - I have arrived in Kolkata at a time when preparations for Durga Puja have begun. Kolkata is being adorned with new colours and fresh vibrancy. When the festival of faith and joy is combined with the festival of development, the happiness doubles. Just a short distance from here, I had the opportunity to lay the foundation stone and inaugurate major projects related to the Kolkata Metro and highways. - West Bengal is one of the largest states in the country in terms of population. Therefore, until the strength of West Bengal is enhanced, the journey towards a developed India cannot succeed. Because the BJP believes, the BJP's conviction is - only when Bengal rises will a developed India be formed. - Over the past 11 years, the BJP government at the Centre has consistently provided every kind of support for the development of West Bengal. The amount of money that the Congress-led UPA government provided in its 10 years for the construction of National Highways in Bengal, our Indian government has given Bengal more than three times that amount. The budget for railways in Bengal has also been increased threefold compared to before. - However, there is a significant challenge facing development work in Bengal. The challenge is that most of the money we send directly to the state government for Bengal... is looted here. That money is spent on TMC cadres. As a result, Bengal lags behind other states in the country in many schemes for the welfare of the poor. - A few years ago, the situation in the neighbouring states of Assam and Tripura was much the same. But ever since the BJP government came to power in Assam and Tripura, the benefits of welfare schemes for the poor have started reaching the people there. Today, the work of providing water to every household in these states is progressing rapidly. Under the Ayushman scheme, free treatment up to 5 lakh rupees is being provided to every poor person. Permanent houses are being built for the poor. - As long as the TMC government remains in Bengal... the development of Bengal will remain obstructed, stalled. That’s why today, every person in Bengal is saying... only when TMC goes will real change come. - The BJP fulfills every resolution it makes. We have recently witnessed proof of this during Operation Sindoor. Our army turned the hideouts of terrorists and their masters across the border into ruins. Our forces taught the terrorists such a lesson that Pakistan is still reeling from it. - Those who have come here to snatch the livelihoods of our people, who have stayed by forging documents... they will have to leave. And for this task to be completed honestly... the TMC government will also have to leave from here. - West Bengal is a border state. The way the demography is being altered in border areas is also creating a social crisis in West Bengal. In particular, farmers are being deceived and their land is being seized, and tribals are being misled to take over their land. The country cannot tolerate this; it must be stopped. Therefore, this time from the Red Fort, I have announced a special demography mission against infiltration. - The BJP believes that until West Bengal develops, the 'yatra' of 'Viksit Bharat' will not be successful...In the past 11 years, the central government has extended every possible help for the development of West Bengal...The money that the central government sends for the development of the state is being looted and is spent on the TMC cadre. End of Article Follow Us On Social Media",
    "sections": {
      "part_1": "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise - top quotes Trending NEW DELHI: Prime Minister Narendra Modi on Friday launched a full-blown attack against West Bengal chief minister Mamata Banerjee and pledged a \"poribortan\" from the Trinamool Congress government.While addressing a rally in Kolkata, the prime minister accused the West Bengal government of diverting money sent by the Centre towards TMC cadres.Here are the top quotes from PM Modi's speech - I have arrived in Kolkata at a time when preparations for Durga Puja have begun. Kolkata is being adorned with new colours and fresh vibrancy. When the festival of faith and joy is combined with the festival of development, the happiness doubles. Just a short distance from here, I had the opportunity to lay the foundation stone and inaugurate major projects related to the Kolkata Metro and highways. - West Bengal is one of the largest states in the country in terms of population. Therefore, until the strength of West Bengal is enhanced, the journey towards a developed India cannot succeed. Because the BJP believes, the BJP's conviction is - only when Bengal rises will a developed India be formed. - Over the past 11 years, the BJP government at the Centre has consistently provided every kind of support for the developmen",
      "part_2": "t of West Bengal. The amount of money that the Congress-led UPA government provided in its 10 years for the construction of National Highways in Bengal, our Indian government has given Bengal more than three times that amount. The budget for railways in Bengal has also been increased threefold compared to before. - However, there is a significant challenge facing development work in Bengal. The challenge is that most of the money we send directly to the state government for Bengal... is looted here. That money is spent on TMC cadres. As a result, Bengal lags behind other states in the country in many schemes for the welfare of the poor. - A few years ago, the situation in the neighbouring states of Assam and Tripura was much the same. But ever since the BJP government came to power in Assam and Tripura, the benefits of welfare schemes for the poor have started reaching the people there. Today, the work of providing water to every household in these states is progressing rapidly. Under the Ayushman scheme, free treatment up to 5 lakh rupees is being provided to every poor person. Permanent houses are being built for the poor. - As long as the TMC government remains in Bengal... the development of Bengal will remain obstructed, stalled. That’s why today, every person in Bengal is saying... only when TMC goes will real change",
      "part_3": "come. - The BJP fulfills every resolution it makes. We have recently witnessed proof of this during Operation Sindoor. Our army turned the hideouts of terrorists and their masters across the border into ruins. Our forces taught the terrorists such a lesson that Pakistan is still reeling from it. - Those who have come here to snatch the livelihoods of our people, who have stayed by forging documents... they will have to leave. And for this task to be completed honestly... the TMC government will also have to leave from here. - West Bengal is a border state. The way the demography is being altered in border areas is also creating a social crisis in West Bengal. In particular, farmers are being deceived and their land is being seized, and tribals are being misled to take over their land. The country cannot tolerate this; it must be stopped. Therefore, this time from the Red Fort, I have announced a special demography mission against infiltration. - The BJP believes that until West Bengal develops, the 'yatra' of 'Viksit Bharat' will not be successful...In the past 11 years, the central government has extended every possible help for the development of West Bengal...The money that the central government sends for the development of the state is being looted and is spent on the TMC cadre. End of Article Follow Us On Social Media"
    },
    "word_count": 686,
    "sentence_count": 43,
    "sentences": [
      "- News - India News - 'TMC jaabe, poribortan hobe': In Kolkata, PM Modi's big charge and a promise - top quotes Trending NEW DELHI: Prime Minister Narendra Modi on Friday launched a full-blown attack against West Bengal chief minister Mamata Banerjee and pledged a \"poribortan\" from the Trinamool Congress government",
      "While addressing a rally in Kolkata, the prime minister accused the West Bengal government of diverting money sent by the Centre towards TMC cadres",
      "Here are the top quotes from PM Modi's speech - I have arrived in Kolkata at a time when preparations for Durga Puja have begun",
      "Kolkata is being adorned with new colours and fresh vibrancy",
      "When the festival of faith and joy is combined with the festival of development, the happiness doubles",
      "Just a short distance from here, I had the opportunity to lay the foundation stone and inaugurate major projects related to the Kolkata Metro and highways",
      "- West Bengal is one of the largest states in the country in terms of population",
      "Therefore, until the strength of West Bengal is enhanced, the journey towards a developed India cannot succeed",
      "Because the BJP believes, the BJP's conviction is - only when Bengal rises will a developed India be formed",
      "- Over the past 11 years, the BJP government at the Centre has consistently provided every kind of support for the development of West Bengal",
      "The amount of money that the Congress-led UPA government provided in its 10 years for the construction of National Highways in Bengal, our Indian government has given Bengal more than three times that amount",
      "The budget for railways in Bengal has also been increased threefold compared to before",
      "- However, there is a significant challenge facing development work in Bengal",
      "The challenge is that most of the money we send directly to the state government for Bengal",
      "is looted here",
      "That money is spent on TMC cadres",
      "As a result, Bengal lags behind other states in the country in many schemes for the welfare of the poor",
      "- A few years ago, the situation in the neighbouring states of Assam and Tripura was much the same",
      "But ever since the BJP government came to power in Assam and Tripura, the benefits of welfare schemes for the poor have started reaching the people there",
      "Today, the work of providing water to every household in these states is progressing rapidly"
    ],
    "character_count": 4034
  },
  "embedding_metadata": {
    "content_type": "article",
    "relevance_score": 0.8,
    "language": "en",
    "source_type": "web",
    "processing_version": "2.0",
    "extraction_method": "trafilatura"
  }
}