{
  "metadata": {
    "url": "https://indianexpress.com/article/cities/kolkata/in-kolkata-pm-slams-tmc-promises-to-end-infiltration-corruption-10205726/",
    "title": "PRIME MINISTER Narendra Modi on Friday launched a sharp attack on the ruling Trinamool Congress (TMC...",
    "domain": "indianexpress.com",
    "extraction_date": "2025-08-26T00:17:15.024676",
    "content_quality": "medium",
    "quality_score": 0.8,
    "content_type": "article"
  },
  "content": {
    "title": "PRIME MINISTER Narendra Modi on Friday launched a sharp attack on the ruling Trinamool Congress (TMC...",
    "summary": "PRIME MINISTER Narendra Modi on Friday launched a sharp attack on the ruling Trinamool Congress (TMC) government in West Bengal, accusing it of “corruption, misrule and obstructing Bengal’s development” despite the Centre providing funds. He said, “….The TMC tried to tear up this bill in Parliament, which shows how deeply this government is steeped in corruption.” Story continues below this ad Modi began his speech in Bengali, saying, “Boro ra pronam neben choto ra bhalo basha….(Greetings to my ...",
    "full_text": "PRIME MINISTER Narendra Modi on Friday launched a sharp attack on the ruling Trinamool Congress (TMC) government in West Bengal, accusing it of “corruption, misrule and obstructing Bengal’s development” despite the Centre providing funds. He said, “….The TMC tried to tear up this bill in Parliament, which shows how deeply this government is steeped in corruption.” Story continues below this ad Modi began his speech in Bengali, saying, “Boro ra pronam neben choto ra bhalo basha….(Greetings to my elders, and love to my young ones.) I bow before all the Gods and Goddesses residing in the sacred places of this land, including the Kali Mandir, the Kali Mata Mandir and the Balaji Bhagwan Mandir in Dum Dum,” he said. Modi chanted six slogans in Bengali, including “TMC jabe, BJP asbe” (TMC will go, BJP will come) and “Bachte chai, BJP Tai” (We want to live, hence we want the BJP), which he said must “reach every household”. He also chanted, “TMC ke shorao, Bangla ke bachao (Remove TMC, save Bengal).” PM Modi claimed that for the past 11 years, the Centre has consistently supported the development of West Bengal. “Today is Kaushiki Amavasya and I extend my best wishes to all of you. I’ve arrived in Kolkata at a time when preparations for the Durga Puja festival are in full swing. The idols are being crafted in Kumartuli, and the city, from Burrabazar to Park Street, is being adorned with lights and decorations. When faith and festivals align with development, the joy we feel is doubled. Story continues below this ad Just a few minutes from this spot, I had the privilege of inaugurating a Metro line. I congratulate the people of Kolkata on this achievement. West Bengal is one of India’s most populous states and its progress is essential for the nation’s success. As the BJP believes, ‘Banglar udoy, Bikoshito Bharater er joy’ (Bengal’s rise is the triumph of developed India).” He highlighted that his government has provided “three times more funds to Bengal than the (erstwhile) UPA government did.” “We have also tripled the railway budget. However, friends, Bengal faces significant obstacles to its development. The funds that the Centre provides directly to the state are largely misappropriated. That money isn’t spent on you; it’s spent on TMC cadres… Which is why Bengal lags behind other states in implementing many poverty alleviation schemes. A similar situation existed in Assam and Tripura, but since the BJP came to power there, these states have started receiving funds for welfare schemes for the poor. The benefits of the Ayushman Yojana, which provides free treatment up to Rs 5 lakh, and the scheme for new homes for the poor are reaching everyone. For everyone in Bengal to receive these benefits, it’s essential that a BJP government comes to power here as well,” said Modi. “One thing is certain this time : TMC jabe, BJP asbe (TMC will go, BJP will come),” he said. Modi’s remarks come ahead of the Assembly polls in Bengal next year. Story continues below this ad Modi reiterated that West Bengal needed a “new light” and “parivartan” (Change). “After Independence, the state saw a long period under the Congress, followed by the Left. 15 years ago, you decided it was time for change. You chose and trusted the slogan of ‘Maa, Mati, Manush’ (Mother, soil, people). But the situation has become worse than before. Corruption has ruined the future. Crime and corruption have become the hallmark of the TMC government. As long as the TMC government is in power, development will remain stalled. That is why the people are saying that only when the TMC goes will real change come — TMC jabe, tobei asol poriborton asbe. We are now 25 years into the 21st century. The coming year is going to be very important for both the country and Bengal.” Bengal needs real change — a change that’s not just a slogan but is visible in action. A change that will provide jobs for Bengal’s sons and daughters within the state and ensure safety of girls and women here. A change that respects farmers and gives them the true value for their crops. A change where corrupts are in jail. This is a change that will bring good governance, and only the BJP can deliver it. Therefore, this message must reach every household in Bengal: ‘Bachte chai, BJP Tai’ (If we want to live, we want the BJP). This is the future of Bengal.” Modi recalled Dr. Syama Prasad Mookerjee and promised to work for prosperity of the state if they come to power. Story continues below this ad “This year marks the 125th birth anniversary of Dr. Syama Prasad Mookerjee, from whose hands the BJP was born. His policies were rooted in the prosperity of Bengal. Had we followed those policies, the state would look very different today. But we became fully dependent. However, we are proud to be the soldiers of Syama Prasad. We are dedicating our lives as his soldiers to fulfill the dreams he had for this land. Today, the nation has taken on the mantra of self-reliance to achieve new heights, and for that, our kolkata is ready.” “In Bengal today, there is only one chant: “TMC k shorao, Bangla ke bachao” (Remove TMC, save Bengal).” The BJP fulfills the resolutions it makes, and the best proof of that is our military’s actions. Our soldiers crossed the border and destroyed terrorist camps, teaching them a lesson that still keeps Pakistan awake at night. I am proud that this region has contributed significantly to strengthening India’s army. The ordnance factory in Ichhapur is a great example of this, as the BJP has given new energy to the defense industry. Today, the factory produces modern rifles, and through small entrepreneurs in the Barrackpore area, thousands of people get jobs,” he said. “If you bring the BJP to power, we will make Bengal the dreamland of Dr Syama Prasad Mookerjee. Dum Dum will once again become an industrial hub with new infrastructure. Bikoshito Bangla (Developed Bengal) is Modi’s guarantee,” said Modi. Story continues below this ad The TMC is an enemy of development and the Dum Dum area is proof of this. It’s one of the most populated regions, yet you can see its condition every day. Development has stalled while the TMC’s mission is to somehow stop central government schemes. I want to ask the people of Bengal: Is this the right approach? Will this kind of politics benefit Bengal? I need your blessings. Give the BJP a chance.” At a time when TMC has launched a movement against the BJP, accusing them of targeting those who speak ‘Bengali Language’ outside, Modi on Friday sought to counter this stance. “With the BJP government that will come to Bengal, extensive infrastructure will be built for Metro and rail, as well as electric vehicles, providing employment for the youth. Bengal has a rich historical heritage and the BJP government is working to empower the Bengali language. We have given Bengali the status of a classical language,” said Modi. “Friends, we are developing inland waterways in the Ganga and there is immense potential for cruise tourism here. We will enhance it so that people are not forced to leave the state for jobs. Story continues below this ad I am concerned about the rising threat of infiltration. The people of West Bengal are forward-thinking, which is why I always discuss national challenges here. In developed countries, campaigns are being run against infiltrators. Shouldn’t infiltrators be driven out? Who can free Bengal from infiltrators? Not Modi, not the BJP — your one vote can do this. Just give one vote, and all the infiltrators will be driven away. We have to provide employment and facilities to our youth. We will not allow infiltrators who are snatching jobs from our youth, putting pressure on our infrastructure, and committing atrocities against our sisters and daughters.” He targeted the political parties in the INDIA alliance stating that they have surrendered to infiltrators. “They have given shelter to these infiltrators, which is creating a social crisis in West Bengal, especially for farmers whose land is being deceitfully seized. The country cannot tolerate this. From the Red Fort, I recently announced a mission to address this demographic change. Those who have come here to snatch the livelihoods of our people must leave. For this to be accomplished honestly, the TMC government must also be removed. Story continues below this ad “The country is united against corruption. This time, the BJP government has brought an anti-corruption bill to the Lok Sabha. I want to specifically talk to the people about this bill. In our country, if a small employee — whether a driver, a canteen worker, or a sanitation worker—is sent to jail and doesn’t get bail within 50 hours, they are automatically suspended from their job,” said Modi. “…But for a Chief Minister or a Prime Minister, there’s no such law. People have fallen so low that they try to run the government from jail. Bengal has seen this many times. A TMC minister, even while jailed in connection the school jobs scam scam, was not ready to give up his post. Another minister, who was jailed in connection with the ration scam, took a similar stance. The public’s feelings are ruthlessly crushed. Do such people – who deceive the public – have the right to remain in their posts? I have seen Chief Ministers go to jail and run the government from there. I cannot stand by and watch the Constitution be disrespected. Bengal will once again become the powerhouse of India’s development. In every street and every neighborhood, there is only one chant and one slogan: “Bachte chai, BJP Tai” (If we want to live, we want the BJP). Once again, I am making this appeal to you,” added Modi.",
    "sections": {
      "methodology": "s to somehow stop central government schemes. I want to ask the people of Bengal: Is this the right approach? Will this kind of politics benefit Bengal? I need your blessings. Give the BJP a chance.” At a time when TMC has launched a movement against the BJP, accusing them of targeting those who speak ‘Bengali Language’ outside, Modi on Friday sought to counter this stance. “With the BJP government that will come to Bengal, extensive infrastructure will be built for Metro and rail, as well as electric vehicles, providing employment for the youth. Bengal has a rich historical heritage and the B"
    },
    "word_count": 1649,
    "sentence_count": 108,
    "sentences": [
      "PRIME MINISTER Narendra Modi on Friday launched a sharp attack on the ruling Trinamool Congress (TMC) government in West Bengal, accusing it of “corruption, misrule and obstructing Bengal’s development” despite the Centre providing funds",
      "He said, “…",
      "The TMC tried to tear up this bill in Parliament, which shows how deeply this government is steeped in corruption",
      "” Story continues below this ad Modi began his speech in Bengali, saying, “Boro ra pronam neben choto ra bhalo basha…",
      "(Greetings to my elders, and love to my young ones",
      ") I bow before all the Gods and Goddesses residing in the sacred places of this land, including the Kali Mandir, the Kali Mata Mandir and the Balaji Bhagwan Mandir in Dum Dum,” he said",
      "Modi chanted six slogans in Bengali, including “TMC jabe, BJP asbe” (TMC will go, BJP will come) and “Bachte chai, BJP Tai” (We want to live, hence we want the BJP), which he said must “reach every household”",
      "He also chanted, “TMC ke shorao, Bangla ke bachao (Remove TMC, save Bengal)",
      "” PM Modi claimed that for the past 11 years, the Centre has consistently supported the development of West Bengal",
      "“Today is Kaushiki Amavasya and I extend my best wishes to all of you",
      "I’ve arrived in Kolkata at a time when preparations for the Durga Puja festival are in full swing",
      "The idols are being crafted in Kumartuli, and the city, from Burrabazar to Park Street, is being adorned with lights and decorations",
      "When faith and festivals align with development, the joy we feel is doubled",
      "Story continues below this ad Just a few minutes from this spot, I had the privilege of inaugurating a Metro line",
      "I congratulate the people of Kolkata on this achievement",
      "West Bengal is one of India’s most populous states and its progress is essential for the nation’s success",
      "As the BJP believes, ‘Banglar udoy, Bikoshito Bharater er joy’ (Bengal’s rise is the triumph of developed India)",
      "” He highlighted that his government has provided “three times more funds to Bengal than the (erstwhile) UPA government did",
      "” “We have also tripled the railway budget",
      "However, friends, Bengal faces significant obstacles to its development"
    ],
    "character_count": 9665
  },
  "embedding_metadata": {
    "content_type": "article",
    "relevance_score": 0.8,
    "language": "en",
    "source_type": "web",
    "processing_version": "2.0",
    "extraction_method": "trafilatura"
  }
}