{
  "metadata": {
    "url": "https://www.newindianexpress.com/nation/2025/Aug/22/in-bengal-pm-modi-raises-infiltration-to-attack-state-government-tmc-hits-back",
    "title": "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams ...",
    "domain": "www.newindianexpress.com",
    "extraction_date": "2025-08-26T00:17:16.098440",
    "content_quality": "medium",
    "quality_score": 0.8,
    "content_type": "article"
  },
  "content": {
    "title": "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams ...",
    "summary": "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams Trinamool, claiming infiltrators “are changing the demography” of West Bengal; TMC counters his charge by calling infiltration Amit Shah's “failure.” KOLKATA: Prime Minister Narendra Modi on Friday launched a sharp attack on the Trinamool Congress, accusing West Bengal’s ruling party of “promoting infiltration” for “the sake of political power and securing votes”. Speaking at a BJP rally at Dum Du...",
    "full_text": "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams Trinamool, claiming infiltrators “are changing the demography” of West Bengal; TMC counters his charge by calling infiltration Amit Shah's “failure.” KOLKATA: Prime Minister Narendra Modi on Friday launched a sharp attack on the Trinamool Congress, accusing West Bengal’s ruling party of “promoting infiltration” for “the sake of political power and securing votes”. Speaking at a BJP rally at Dum Dum Central Jail Maidan in Kolkata, he said the BJP-led Union government had launched a campaign against infiltrators “who are changing the demography of West Bengal.” Calling infiltration a serious concern, Modi said the country would not tolerate the problem any longer. “Who will chase away the infiltrators? Who can free Bengal from infiltrators? Your one vote can solve this problem. Vote once, they will all run away,” he said, urging people to back the BJP. Intensifying his criticism of the Trinamool Congress (TMC), he said, “Trinamool and some political parties are supporting them (infiltrators) for power and votes. In some places, they are also taking their help. West Bengal is a border state. The way infiltration is increasing, it is becoming a social problem.” “They are snatching the land of farmers. They are snatching the land of tribals. This cannot be tolerated. That is why a special mission has been announced against the infiltrators. Those who have been staying for so long by making fake papers must go. The Trinamool government must also go so that this work can be done properly,” Modi added. The TMC countered Modi’s charge by blaming the Centre for infiltration. In a post on X, the party said: “And whose colossal failure allowed infiltration to happen in the first place? Under Home Minister @AmitShah, who controls the BSF, borders remain porous while terrorists slip through and attack innocent citizens.” “@BJP4India’s idea of ‘protecting the nation’ is blame-shifting, incompetence, and hypocrisy. Before pointing fingers at Bengal, they must answer for their own disastrous border security!” it added. Meanwhile, the prime minister accused the opposition INDIA bloc, including the TMC, of shielding corruption and resisting legislation aimed at ensuring integrity in public life. Without naming anyone, Modi referred to the Constitution (130th Amendment) Bill, 2025, introduced in Parliament earlier this week. The Bill seeks to bar prime ministers, chief ministers and ministers from holding office if they remain in jail for 30 days or more. “An anti-corruption bill has been brought in the Lok Sabha this time. In our country, if even a small government employee has to be taken into police custody, if bail is not granted within 50 hours, his job will be lost. Even if a small worker goes to jail for two days, his life is over. But there is no such law for the Chief Minister or Prime Minister if they go to jail,” Modi said. In a veiled reference to former Delhi chief minister Arvind Kejriwal, he added: “Many Chief Ministers even after going to jail, have been running the government from there. This is an insult to the constitution. We will not allow this.” “But the Trinamool people are opposing this. The Trinamool people wanted to tear up this bill in Parliament. This means that the Trinamool politics is based on corruption,” he alleged. Modi went on to say: “Two TMC ministers, even after going to jail on corruption charges, were not willing to give up their posts.” He was referring to former education minister Partha Chatterjee, arrested in the teachers’ recruitment scam, and Jyoti Priya Mallick, arrested in the ration distribution scam. Responding to Trinamool’s allegation that the BJP had attacked the Bengali language, Modi said: “The BJP government is proudly working to strengthen the Bengali language and Bengali culture. We are the ones who have given the Bengali language the status of a classical language.” Calling on voters to oust the TMC government, he said: “First, Bengal has seen the rule of Congress, then the Left. Fifteen years ago, you decided to change by believing in the Maa Mati Manush. But that made the situation worse than before. ‘Crime’ and ‘corruption’ are the hallmarks of the TMC government. It is certain that as long as there is a Trinamool government in Bengal, development in Bengal will remain stagnant. Only when Trinamool goes, real change will come.” “Form a BJP government in Bengal. We will make the Bengal of Shama Prasad Mookerjee’s dream. Developed Bengal, Modi’s guarantee. BJP has a roadmap for the development of Bengal. But Trinamool does not. Trinamool is the enemy of development… We need to bring back the past glory of Bengal. So, we have to say together, remove Trinamool. Save Bengal,” he said. Earlier in the day, Modi laid the foundation stone and inaugurated projects worth over Rs 5,200 crore at a programme in Dum Dum. These included the Sealdah–Esplanade Metro Section, Beleghata–Hemanta Mukhopadhyay Section and Noapara–Jai Hind (Biman Bandar) Section, and the foundation stone for the six-lane elevated Kona Expressway. Sharing his experience of a Kolkata Metro journey from Noapara to Jai Hind Airport, he said colleagues expressed happiness over the modernisation of Kolkata’s transport system. “Cities like Kolkata are a rich embodiment of both India’s history and its future. As India moves towards becoming the world’s third-largest economy, cities such as Dum Dum and Kolkata will play a pivotal role,” he said. He noted that India now has the world’s third-largest metro network, growing from 250 km in 2014 to more than 1,000 km today, with Kolkata seeing steady expansion. He said about 14 km of new lines and seven stations are being added to the city’s network, which would improve ease of living and travel. The Sealdah–Esplanade Metro Section is part of the East-West Metro Corridor, built with a 64,833 million yen loan from the Japan International Cooperation Agency (JICA). No stories found. The New Indian Express www.newindianexpress.com",
    "sections": {
      "part_1": "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams Trinamool, claiming infiltrators “are changing the demography” of West Bengal; TMC counters his charge by calling infiltration Amit Shah's “failure.” KOLKATA: Prime Minister Narendra Modi on Friday launched a sharp attack on the Trinamool Congress, accusing West Bengal’s ruling party of “promoting infiltration” for “the sake of political power and securing votes”. Speaking at a BJP rally at Dum Dum Central Jail Maidan in Kolkata, he said the BJP-led Union government had launched a campaign against infiltrators “who are changing the demography of West Bengal.” Calling infiltration a serious concern, Modi said the country would not tolerate the problem any longer. “Who will chase away the infiltrators? Who can free Bengal from infiltrators? Your one vote can solve this problem. Vote once, they will all run away,” he said, urging people to back the BJP. Intensifying his criticism of the Trinamool Congress (TMC), he said, “Trinamool and some political parties are supporting them (infiltrators) for power and votes. In some places, they are also taking their help. West Bengal is a border state. The way infiltration is increasing, it is becoming a social problem.” “They are snatching the land of farmers. They are snatching the land of tribals. This cannot be tolerated. That is why a special mission has been announced against the infiltrators. Those who have been staying for so long by making fake papers must go. The Trinamool government must also go so that this work can be done properly,” Modi added. The TMC countered Modi’s charge by blaming the Centre for infiltration. In a post on X, the party said: “And whose colossal failure allowed infiltration to happen in the first place? Under Home Minister @AmitShah, who controls the BSF, borders remain porous while terrorists slip through and attack innocent citizens.” “@BJP4India’s idea of ‘protecting the nation’ is blame-shifting, incompetence, and hyp",
      "part_2": "ocrisy. Before pointing fingers at Bengal, they must answer for their own disastrous border security!” it added. Meanwhile, the prime minister accused the opposition INDIA bloc, including the TMC, of shielding corruption and resisting legislation aimed at ensuring integrity in public life. Without naming anyone, Modi referred to the Constitution (130th Amendment) Bill, 2025, introduced in Parliament earlier this week. The Bill seeks to bar prime ministers, chief ministers and ministers from holding office if they remain in jail for 30 days or more. “An anti-corruption bill has been brought in the Lok Sabha this time. In our country, if even a small government employee has to be taken into police custody, if bail is not granted within 50 hours, his job will be lost. Even if a small worker goes to jail for two days, his life is over. But there is no such law for the Chief Minister or Prime Minister if they go to jail,” Modi said. In a veiled reference to former Delhi chief minister Arvind Kejriwal, he added: “Many Chief Ministers even after going to jail, have been running the government from there. This is an insult to the constitution. We will not allow this.” “But the Trinamool people are opposing this. The Trinamool people wanted to tear up this bill in Parliament. This means that the Trinamool politics is based on corruption,” he alleged. Modi went on to say: “Two TMC ministers, even after going to jail on corruption charges, were not willing to give up their posts.” He was referring to former education minister Partha Chatterjee, arrested in the teachers’ recruitment scam, and Jyoti Priya Mallick, arrested in the ration distribution scam. Responding to Trinamool’s allegation that the BJP had attacked the Bengali language, Modi said: “The BJP government is proudly working to strengthen the Bengali language and Bengali culture. We are the ones who have given the Bengali language the status of a classical language.” Calling on voters to oust the TMC government, he said: “First, Bengal has",
      "part_3": "seen the rule of Congress, then the Left. Fifteen years ago, you decided to change by believing in the Maa Mati Manush. But that made the situation worse than before. ‘Crime’ and ‘corruption’ are the hallmarks of the TMC government. It is certain that as long as there is a Trinamool government in Bengal, development in Bengal will remain stagnant. Only when Trinamool goes, real change will come.” “Form a BJP government in Bengal. We will make the Bengal of Shama Prasad Mookerjee’s dream. Developed Bengal, Modi’s guarantee. BJP has a roadmap for the development of Bengal. But Trinamool does not. Trinamool is the enemy of development… We need to bring back the past glory of Bengal. So, we have to say together, remove Trinamool. Save Bengal,” he said. Earlier in the day, Modi laid the foundation stone and inaugurated projects worth over Rs 5,200 crore at a programme in Dum Dum. These included the Sealdah–Esplanade Metro Section, Beleghata–Hemanta Mukhopadhyay Section and Noapara–Jai Hind (Biman Bandar) Section, and the foundation stone for the six-lane elevated Kona Expressway. Sharing his experience of a Kolkata Metro journey from Noapara to Jai Hind Airport, he said colleagues expressed happiness over the modernisation of Kolkata’s transport system. “Cities like Kolkata are a rich embodiment of both India’s history and its future. As India moves towards becoming the world’s third-largest economy, cities such as Dum Dum and Kolkata will play a pivotal role,” he said. He noted that India now has the world’s third-largest metro network, growing from 250 km in 2014 to more than 1,000 km today, with Kolkata seeing steady expansion. He said about 14 km of new lines and seven stations are being added to the city’s network, which would improve ease of living and travel. The Sealdah–Esplanade Metro Section is part of the East-West Metro Corridor, built with a 64,833 million yen loan from the Japan International Cooperation Agency (JICA). No stories found. The New Indian Express www.newindianexpress.com"
    },
    "word_count": 983,
    "sentence_count": 65,
    "sentences": [
      "Nation# In Bengal, PM Modi raises infiltration to attack state government; TMC hits back Modi slams Trinamool, claiming infiltrators “are changing the demography” of West Bengal; TMC counters his charge by calling infiltration Amit Shah's “failure",
      "” KOLKATA: Prime Minister Narendra Modi on Friday launched a sharp attack on the Trinamool Congress, accusing West Bengal’s ruling party of “promoting infiltration” for “the sake of political power and securing votes”",
      "Speaking at a BJP rally at Dum Dum Central Jail Maidan in Kolkata, he said the BJP-led Union government had launched a campaign against infiltrators “who are changing the demography of West Bengal",
      "” Calling infiltration a serious concern, Modi said the country would not tolerate the problem any longer",
      "“Who will chase away the infiltrators",
      "Who can free Bengal from infiltrators",
      "Your one vote can solve this problem",
      "Vote once, they will all run away,” he said, urging people to back the BJP",
      "Intensifying his criticism of the Trinamool Congress (TMC), he said, “Trinamool and some political parties are supporting them (infiltrators) for power and votes",
      "In some places, they are also taking their help",
      "West Bengal is a border state",
      "The way infiltration is increasing, it is becoming a social problem",
      "” “They are snatching the land of farmers",
      "They are snatching the land of tribals",
      "This cannot be tolerated",
      "That is why a special mission has been announced against the infiltrators",
      "Those who have been staying for so long by making fake papers must go",
      "The Trinamool government must also go so that this work can be done properly,” Modi added",
      "The TMC countered Modi’s charge by blaming the Centre for infiltration",
      "In a post on X, the party said: “And whose colossal failure allowed infiltration to happen in the first place"
    ],
    "character_count": 6077
  },
  "embedding_metadata": {
    "content_type": "article",
    "relevance_score": 0.8,
    "language": "en",
    "source_type": "web",
    "processing_version": "2.0",
    "extraction_method": "trafilatura"
  }
}