{
  "metadata": {
    "url": "https://www.chhattisgarhgyan.in/2020/01/Homi-jahangir-bhabha.html",
    "title": "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक...",
    "domain": "www.chhattisgarhgyan.in",
    "extraction_date": "2025-08-22T22:13:01.808055",
    "content_quality": "medium",
    "quality_score": 0.7,
    "content_type": "article"
  },
  "content": {
    "title": "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक...",
    "summary": "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक प्रमुख वैज्ञानिक थे भारत का परमाणु कार्यक्रम डा. होमी जहांगीर भाभा के नेतृत्व में आरम्भ हुआ। उन्होने मुट्ठी भर वैज्ञानिकों की सहायता से मार्च 1944 में नाभिकीय उर्जा पर अनुसन्धान आरम्भ किया। भाभा को 'आर्किटेक्ट ऑफ इंडियन एटॉमिक एनर्जी प्रोग्राम' भी कहा जाता है। मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से ...",
    "full_text": "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक प्रमुख वैज्ञानिक थे भारत का परमाणु कार्यक्रम डा. होमी जहांगीर भाभा के नेतृत्व में आरम्भ हुआ। उन्होने मुट्ठी भर वैज्ञानिकों की सहायता से मार्च 1944 में नाभिकीय उर्जा पर अनुसन्धान आरम्भ किया। भाभा को 'आर्किटेक्ट ऑफ इंडियन एटॉमिक एनर्जी प्रोग्राम' भी कहा जाता है। मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। भारत को परमाणु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा. भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व किया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। 11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था। **शिक्षा:**मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। **परमाणु कार्यक्रम:**भारत को परमाणु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा. भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व किया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। **मृत्यू**:भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। **विवाद:**11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था।",
    "sections": {
      "part_1": "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक प्रमुख वैज्ञानिक थे भारत का परमाणु कार्यक्रम डा. होमी जहांगीर भाभा के नेतृत्व में आरम्भ हुआ। उन्होने मुट्ठी भर वैज्ञानिकों की सहायता से मार्च 1944 में नाभिकीय उर्जा पर अनुसन्धान आरम्भ किया। भाभा को 'आर्किटेक्ट ऑफ इंडियन एटॉमिक एनर्जी प्रोग्राम' भी कहा जाता है। मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। भारत को परमाणु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा. भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व क",
      "part_2": "िया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। 11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था। **शिक्षा:**मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। **परमाणु कार्यक्रम:**भारत को परमाण",
      "part_3": "ु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा. भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व किया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। **मृत्यू**:भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। **विवाद:**11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था।"
    },
    "word_count": 701,
    "sentence_count": 4,
    "sentences": [
      "होमी जहांगीर भाभा जी का जन्म 30 अक्टूबर, 1909 को मुंबई में एक पारसी परिवार में हुआ था। वे भारत के एक प्रमुख वैज्ञानिक थे भारत का परमाणु कार्यक्रम डा",
      "होमी जहांगीर भाभा के नेतृत्व में आरम्भ हुआ। उन्होने मुट्ठी भर वैज्ञानिकों की सहायता से मार्च 1944 में नाभिकीय उर्जा पर अनुसन्धान आरम्भ किया। भाभा को 'आर्किटेक्ट ऑफ इंडियन एटॉमिक एनर्जी प्रोग्राम' भी कहा जाता है। मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। भारत को परमाणु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा",
      "भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व किया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। 11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था। **शिक्षा:**मुंबई से कैथड्रल और जॉन केनन स्कूल से पढ़ाई पूरी की। फिर एल्फिस्टन कॉलेज मुंबई और रोयाल इंस्टीट्यूट ऑफ साइंस से बीएससी पास किया। मुंबई से पढ़ाई पूरी करने के बाद भाभा वर्ष 1927 में इंग्लैंड के कैअस कॉलेज, कैंब्रिज इंजीनियरिंग की पढ़ाई करने गए। कैम्ब्रिज विश्वविद्यालय में रहकर वर्ष 1930 में स्नातक उपाधि अर्जित की। वर्ष 1934 में कैम्ब्रिज विश्वविद्यालय से उन्होंने डाक्टरेट की उपाधि प्राप्त की। जर्मनी में उन्होंने कास्मिक किरणों पर अध्ययन और प्रयोग किए। **परमाणु कार्यक्रम:**भारत को परमाणु शक्ति बनाने के मिशन में प्रथम पग के तौर पर उन्होंने 1945 में मूलभूत विज्ञान में उत्कृष्टता के केंद्र टाटा इंस्टीट्यूट ऑफ फंडामेंटल रिसर्च (टीआइएफआर) की स्थापना की। डा",
      "भाभा एक कुशल वैज्ञानिक और प्रतिबद्ध इंजीनियर होने के साथ-साथ एक समर्पित वास्तुशिल्पी, सतर्क नियोजक, एवं निपुण कार्यकारी थे। वर्ष 1947 में भारत सरकार द्वारा गठित परमाणु ऊर्जा आयोग के प्रथम अध्यक्ष नियुक्त हुए। वर्ष 1953 में जेनेवा में अनुष्ठित विश्व परमाणुविक वैज्ञानिकों के महासम्मेलन में उन्होंने सभापतित्व किया। 3 जनवरी वर्ष 1954 को परमाणु उर्जा आयोग के द्वारा परमाणु उर्जा संस्थान (ए ई ई टी) के नाम से आरम्भ हुआ और तत्कालीन प्रधान मंत्री जवाहरलाल नेहरू द्वारा 20 जनवरी,1957 को राष्ट्र को समर्पित किया गया। इसके बाद परमाणु उर्जा संस्थान को पुनर्निर्मित कर 12 जनवरी, 1967 को इसका नया नाम भाभा परमाणु अनुसंधान केन्द्र किया गया। **मृत्यू**:भारतीय परमाणु ऊर्जा कार्यक्रम के जनक का 24 जनवरी, 1966 को एक विमान दुर्घटना में निधन हो गया था। **विवाद:**11 जुलाई 2008 को पत्रकार ग्रेगरी डगलस और CIA अफसर रॉबर्ट क्राओली के बीच हुई बातचीत छापी थी जिसमें क्राओली कहते हैं कि 'भारत ने 60 के दशक में परमाणु बम पर काम शुरू कर दिया था, जो हमारे लिए समस्या थी।' इसी बातचीत में क्राओली होमी जहांगीर भाभा को 'खतरनाक' बताते हुये कहता है कि भाभा जिस वियना की उड़ान पर थे उससे परेशानी और बढ़ती, इसी उड़ान के दौरान विमान के कार्गो में रखे बम में विस्फोट हुआ था।"
    ],
    "character_count": 3924
  },
  "embedding_metadata": {
    "content_type": "article",
    "relevance_score": 0.7,
    "language": "en",
    "source_type": "web",
    "processing_version": "2.0",
    "extraction_method": "trafilatura"
  }
}