{
  "arxiv_id": "1201.2400v4",
  "title": "On the capture of dark matter by neutron stars",
  "abstract": "We calculate the number of dark matter particles that a neutron star\naccumulates over its lifetime as it rotates around the center of a galaxy, when\nthe dark matter particle is a self-interacting boson but does not\nself-annihilate. We take into account dark matter interactions with baryonic\nmatter and the time evolution of the dark matter sphere as it collapses within\nthe neutron star. We show that dark matter self-interactions play an important\nrole in the rapid accumulation of dark matter in the core of the neutron star.\nWe consider the possibility of determining an exclusion region of the parameter\nspace for dark matter mass and dark matter interaction cross sections based on\nthe observation of old neutron stars with strong dark matter self-interactions.\nWe show that for a dark matter density of $~10^3$ GeV/cm$^3$ and dark matter\nmass $m_\\chi$ less than approximately 10 GeV, there is a potential exclusion\nregion for dark matter interactions with nucleons that is three orders of\nmagnitude more stringent than without self-interactions. The potential\nexclusion region for dark matter self-interaction cross sections is many orders\nof magnitude stronger than the current Bullet Cluster limit. For example, for\nhigh dark matter density regions, we find that for $m_\\chi\\sim 10$ GeV when the\ndark matter interaction cross section with the nucleons ranges from\n$\\sigma_{\\chi n}\\sim 10^{-52}$ cm$^2$ to $10^{-57}$ cm$^2$, the dark matter\nself-interaction cross section limit is $\\sigma_{\\chi\\chi}< 10^{-33}$ cm$^2$,\nwhich is about ten orders of magnitude stronger than the Bullet Cluster limit.",
  "authors": [
    "Tolga Guver",
    "Arif Emre Erkoca",
    "Mary Hall Reno",
    "Ina Sarcevic"
  ],
  "published": "2012-01-11T20:38:51Z",
  "categories": [
    "hep-ph",
    "astro-ph.GA"
  ],
  "pdf_url": "http://arxiv.org/pdf/1201.2400v4",
  "url": "http://arxiv.org/abs/1201.2400v4",
  "download_date": "2025-08-16T05:08:52.037760",
  "pdf_path": "./scraped_data\\arxiv\\pdfs\\1201.2400v4.pdf",
  "file_size": 604464,
  "relevance_score": 138
}