{
  "arxiv_id": "2406.09740v2",
  "title": "Deep Symbolic Optimization for Combinatorial Optimization: Accelerating\n  Node Selection by Discovering Potential Heuristics",
  "abstract": "Combinatorial optimization (CO) is one of the most fundamental mathematical\nmodels in real-world applications. Traditional CO solvers, such as\nBranch-and-Bound (B&B) solvers, heavily rely on expert-designed heuristics,\nwhich are reliable but require substantial manual tuning. Recent studies have\nleveraged deep learning (DL) models as an alternative to capture rich feature\npatterns for improved performance on GPU machines. Nonetheless, the drawbacks\nof high training and inference costs, as well as limited interpretability,\nseverely hinder the adoption of DL methods in real-world applications. To\naddress these challenges, we propose a novel deep symbolic optimization\nlearning framework that combines their advantages. Specifically, we focus on\nthe node selection module within B&B solvers -- namely, deep symbolic\noptimization for node selection (Dso4NS). With data-driven approaches, Dso4NS\nguides the search for mathematical expressions within the high-dimensional\ndiscrete symbolic space and then incorporates the highest-performing\nmathematical expressions into a solver. The data-driven model captures the rich\nfeature information in the input data and generates symbolic expressions, while\nthe expressions deployed in solvers enable fast inference with high\ninterpretability. Experiments demonstrate the effectiveness of Dso4NS in\nlearning high-quality expressions, outperforming existing approaches on a CPU\nmachine. Encouragingly, the learned CPU-based policies consistently achieve\nperformance comparable to state-of-the-art GPU-based approaches.",
  "authors": [
    "Hongyu Liu",
    "Haoyang Liu",
    "Yufei Kuang",
    "Jie Wang",
    "Bin Li"
  ],
  "published": "2024-06-14T06:02:14Z",
  "categories": [
    "cs.LG"
  ],
  "pdf_url": "http://arxiv.org/pdf/2406.09740v2",
  "url": "http://arxiv.org/abs/2406.09740v2",
  "download_date": "2025-08-16T05:36:37.509285",
  "pdf_path": "./scraped_data\\arxiv\\pdfs\\2406.09740v2.pdf",
  "file_size": 1007108,
  "relevance_score": 88
}